# GetRebarRoundingManager Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReinforcementSettings..::..GetRebarRoundingManager Method
ReinforcementSettings Class See Also
---
Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public RebarRoundingManager GetRebarRoundingManager()
```

Visual Basic
---
```text
Public Function GetRebarRoundingManager As RebarRoundingManager
```

Visual C++
---
```text
public:
RebarRoundingManager^ GetRebarRoundingManager()
```

# ### Return Value
The rounding manager.
# See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace